# Rebar Set Bar Hidden Status Method

Source: https://www.revitapidocs.com/2026/9f58c248-58b9-47b9-4367-ead7f53695d6.htm

---

| Rebar Set Bar Hidden Status Method |
| --- |

Sets the bar in this rebar set to be hidden or unhidden in the given view.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetBarHiddenStatus(
	View view,
	int barIndex,
	bool hide
)
```

```
Public Sub SetBarHiddenStatus (
	view As View,
	barIndex As Integer,
	hide As Boolean
)
```

```
public:
void SetBarHiddenStatus(
	View^ view,
	int barIndex,
	bool hide
)
```

```
member SetBarHiddenStatus :
        view : View *
        barIndex : int *
        hide : bool -> unit
```

#### Parameters

view View
:   The view.

barIndex Int32
:   The index of the bar from this set.

hide Boolean
:   True to hide this bar in the view, false to unhide the bar.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | This rebar cannot have a presentation mode applied for view, as the view is not valid for rebar presentation,  or the orientation of the view matches the normal direction of the rebar element. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | barIndex should be in range \[ 0, NumberOfBarPositions\-1 ] and the bar at barIndex should be included. |
| InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

Remarks Individual bars of a rebar set can be hidden in a view only
 if the presentation mode is RebarPresentationMode.Select.
 If that is not the presentation mode assigned for this set in the view,
 this method will also change it. See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace